import styles from "../PrivacyPolicy/PrivacyPolicy.module.css";
import { HeaderAdd } from "../../Header/HeaderAdd/HeaderAdd";

export const UserAgreement: React.FC = () => {
  return (
    <>
      <div className="Wrapper">
        <HeaderAdd />
        </div>
       <div className="Wrapper">
        <section className={styles.SectionPrivacyPolicy}>
            <h1>Пользовательское соглашение EasyWords/EasyWordsApp (для предзаказа мобильного приложения)</h1>
                <span className={styles.TextStrong}>Пожалуйста, внимательно ознакомьтесь с нашим Пользовательским соглашением перед оформлением предзаказа и использованием мобильного приложения EasyWords/EasyWordsApp. Ниже приведены условия, ограничения и ответственность, которые применяются к вам как пользователю при использовании наших сервисов.
                </span>
            <p>
                <span><span className={styles.TextStrong}>1. Принятие условий </span>1.1. Оформление предзаказа на мобильное приложение EasyWords на сайте [https://easywordsapp.com] и/или последующее использование самого мобильного приложения EasyWords/EasyWordsApp (далее – «Приложение», «Сервис») означает ваше полное и безоговорочное согласие с настоящим Пользовательским соглашением (далее – «Соглашение»). 1.2. Если вы не согласны с данными условиями, пожалуйста, не оформляйте предзаказ и прекратите использование Сервиса немедленно.</span>
            </p>
            <p>
                <span><span className={styles.TextStrong}>2. Информация о Сервисе EasyWords/EasyWordsApp </span> 2.1. EasyWords/EasyWordsApp — это мобильное приложение для изучения английских слов, основанное на <span className={styles.TextStrong}>уникальной методике логического кодирования</span>, которая объединяет лучшие практики, такие как флэш-карточки, мнемотехника и интервальное повторение. 2.2. Сервис предназначен для личного некоммерческого использования с целью изучения и запоминания английских слов. 2.3. Информация о функциях, методиках и ожидаемых результатах использования Сервиса, представленная на нашем сайте и в рекламных материалах, носит ознакомительный характер. Мы постоянно работаем над улучшением Приложения, и некоторые функции могут быть изменены или дополнены в финальной версии.</span>
            </p>
            <p>
                <span><span className={styles.TextStrong}>3. Предварительный заказ (Предзаказ) </span> 3.1. Оформляя предзаказ на Приложение, вы выражаете свою заинтересованность в его получении после официального релиза. 3.2. Факт оформления предзаказа не является актом покупки или заключением договора купли-продажи. Это выражение намерения приобрести Приложение или получить к нему доступ после его выхода. 3.3. Мы обязуемся уведомить вас о выходе Приложения и/или о начале продаж/предоставления доступа к нему по указанному вами адресу электронной почты. 3.4. Мы оставляем за собой право изменять условия и сроки релиза Приложения.
                </span>
            </p>
            <p>
                <span><span className={styles.TextStrong}>4. Предварительный заказ (Предзаказ) </span> 3.1. Оформляя предзаказ на Приложение, вы выражаете свою заинтересованность в его получении после официального релиза. 3.2. Факт оформления предзаказа не является актом покупки или заключением договора купли-продажи. Это выражение намерения приобрести Приложение или получить к нему доступ после его выхода. 3.3. Мы обязуемся уведомить вас о выходе Приложения и/или о начале продаж/предоставления доступа к нему по указанному вами адресу электронной почты. 3.4. Мы оставляем за собой право изменять условия и сроки релиза Приложения.
                </span>
            </p>
            <p>
                <span><span className={styles.TextStrong}>5. Предварительный заказ (Предзаказ) </span> 3.1. Оформляя предзаказ на Приложение, вы выражаете свою заинтересованность в его получении после официального релиза. 3.2. Факт оформления предзаказа не является актом покупки или заключением договора купли-продажи. Это выражение намерения приобрести Приложение или получить к нему доступ после его выхода. 3.3. Мы обязуемся уведомить вас о выходе Приложения и/или о начале продаж/предоставления доступа к нему по указанному вами адресу электронной почты. 3.4. Мы оставляем за собой право изменять условия и сроки релиза Приложения.
                </span>
            </p>
            <p>
                <span>
                    <span className={styles.TextStrong}>Права интеллектуальной собственности</span> 6.1. Все права на Приложение/Сервис, включая, но не ограничиваясь, программное обеспечение, дизайн, текст, графику, уникальную методику логического кодирования, структуру, а также все другие материалы и компоненты Сервиса, принадлежат [ИП Шениным Артемом Валерьевичем, ИНН 101301845704, ОГРНИП 316100100061158] и защищены законодательством об интеллектуальной собственности. 6.2. Настоящее Соглашение предоставляет вам ограниченную, неисключительную, непередаваемую, отзывную лицензию на использование Приложения/Сервиса исключительно для личного, некоммерческого использования в соответствии с условиями настоящего Соглашения.</span>
            </p>
            <p>
                <span>
                    <span className={styles.TextStrong}>7. Изменения условий</span>7.1. Мы оставляем за собой право в любое время вносить изменения в настоящее Пользовательское соглашение. Изменения вступают в силу с момента их публикации на сайте [https://easywordsapp.com] и/или в Приложении. 7.2. Мы уведомим вас о существенных изменениях путем размещения уведомления на сайте, в Приложении или иным доступным способом. 7.3. Продолжая использование Сервиса после внесения изменений, вы подтверждаете свое согласие с новыми условиями.
                </span>
            </p>
            <p>
                <span><span className={styles.TextStrong}>8. Заключительные положения </span> 8.1. Настоящее Пользовательское соглашение является юридически обязательным документом, регулирующим ваше использование Сервиса. В случае несогласия с данными условиями, прекратите использование Сервиса немедленно. 8.2. Если какое-либо положение настоящего Соглашения будет признано недействительным или неприменимым, остальные положения Пользовательского соглашения сохраняют свою силу. 8.3. К отношениям между пользователем и EasyWords/EasyWordsApp, возникающим из настоящего Соглашения, применяется законодательство Российской Федерации. Споры, возникающие из настоящего Соглашения, подлежат разрешению путем переговоров. В случае недостижения согласия, спор будет рассмотрен в судебном порядке
                </span>
            </p>
            <p>
                <span><span className={styles.TextStrong}>9. Контактная информация</span>Если у вас есть вопросы относительно настоящего Соглашения, пожалуйста, свяжитесь с нами по адресу: info@easywordsapp.com
                </span>
            </p>
      </section>
      </div>
    </>
  );
};
